app/Notifications/OrderNotification.php

select * from `tables` where `tables`.`id` = '228' and `tables`.`id` is not null limit 1
---
    public function toMail($notifiable)
    {
        //Change currency
        \App\Services\ConfChanger::switchCurrency( $this->order->restorant);

        if ($this->status.'' == '1') {
            //Created
            $greeting = __('There is new order');
            $line = $this->order->delivery_method.'' == '3'? __('You have just received an order on table').' '.$this->order->table->name :  __('You have just received an order');

select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name`, `order_has_items`.`id` as `pivot_id` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 603 and `items`.`deleted_at` is null
---
        //Add order details
        $message->line(__('Order items'));
        $message->line(__('________________'));
        foreach ($this->order->items as $key => $item) {