app/Repositories/Orders/BaseOrderRepository.php

insert into `orders` (`restorant_id`, `comment`, `payment_method`, `payment_status`, `delivery_method`, `client_id`, `order_price`, `vatvalue`, `updated_at`, `created_at`) values (16, '', 'cod', 'unpaid', 3, 2, 0, 0, '2021-11-16 22:33:51', '2021-11-16 22:33:51')
---
    private function createOrder(){
        if($this->order==null){
            $this->order=new Order;
            $this->order->restorant_id=$this->vendor->id;
            $this->order->comment="";
            $this->order->payment_method=$this->request->payment_method;
            $this->order->payment_status="unpaid";

            $expeditionsTypes=['delivery'=>1,'pickup'=>2,'dinein'=>3]; //1- delivery 2 - pickup 3-dinein
            $this->order->delivery_method=$expeditionsTypes[$this->expedition];

            //Client
            if(auth()->user()){
                $this->order->client_id=auth()->user()->id;
            }

            //TODO Set initials like VAT, prices etc to 0
            $this->order->order_price=0;
            $this->order->vatvalue=0;

            //Save order
            $this->order->save();

select `items`.*, `order_has_items`.`order_id` as `pivot_order_id`, `order_has_items`.`item_id` as `pivot_item_id`, `order_has_items`.`qty` as `pivot_qty`, `order_has_items`.`extras` as `pivot_extras`, `order_has_items`.`vat` as `pivot_vat`, `order_has_items`.`vatvalue` as `pivot_vatvalue`, `order_has_items`.`variant_price` as `pivot_variant_price`, `order_has_items`.`variant_name` as `pivot_variant_name`, `order_has_items`.`id` as `pivot_id` from `items` inner join `order_has_items` on `items`.`id` = `order_has_items`.`item_id` where `order_has_items`.`order_id` = 603 and `items`.`deleted_at` is null
---
        //After we have updated the list of items, we need to update the order price
        $order_price=0;
        $total_order_vat=0;
        foreach ($this->order->items()->get() as $key => $item) {