app/Repositories/Orders/LocalOrderRepository.php

    public function setInitialStatus(){
        //Only if the order is new
        if($this->isNewOrder){
            //Set the just created status
            $this->order->status()->attach(1, ['user_id'=>$this->vendor->user->id, 'comment'=>'Local order']);
---
select * from `users` where `users`.`id` = 2 and `users`.`deleted_at` is null limit 1