app/Http/Controllers/CartController.php

    public function add(Request $request)
    {
        if(isset($request->session_id)){
            $this->setSessionID($request->session_id);
        }

        $item = Items::find($request->id);
        $restID = $item->category->restorant->id;

        $restaurant = Restorant::findOrFail($restID);
---
select * from `categories` where `categories`.`id` = 68 and `categories`.`deleted_at` is null limit 1

                $addresses = $this->getAccessibleAddresses($restaurant, auth()->user()->addresses->reverse());
            }

            $tables = Tables::where('restaurant_id', $restaurant->id)->get();
---
select * from `tables` where `restaurant_id` = 16