app/Http/Controllers/SettingsController.php

            $img16->save(public_path().'/favicon-16x16.png');
        }

        $settings->update();
---
update `settings` set `site_logo_dark` = 'd64f7592-642f-4187-99e4-5393f8df6a07', `settings`.`updated_at` = '2021-11-16 22:16:22' where `id` = 1