app/Http/Controllers/SettingsController.php

select count(*) as aggregate from `restorants` where `phone` = '(530) 625-9694'
---
            //$jsfront = file_get_contents(__DIR__.'/../../../public/byadmin/front.js');
            //dd($cssfront);

            $hasDemoRestaurants = Restorant::where('phone', '(530) 625-9694')->count() > 0;